Repository: MatrixMike/mintreport
Catalog: po/mintreport-*.po
Languages: uz

source: System Reports
uz: Tizim hisobotlari

source: _File
uz: _Fayl

source: Refresh
uz: Yangilash

source: Restore ignored reports
uz: E’tiborsiz qoldirilgan hisobotlarni tiklash

source: Quit
uz: Chiqish

source: _Help
uz: _Yordam

source: About
uz: Haqida

source: An error occurred while gathering the system information.
uz: Tizim ma’lumotlarini yig‘ishda xatolik yuz berdi.

source: System information copied
uz: Tizim haqida ma'lumot nusxalandi

source: Your system information was copied into your clipboard so you can paste it on the forums.
uz: Tizim haqida ma’lumot almashish buferiga nusxalandi va forumlarga joylashtirilishi mumkin.

source: System information uploaded
uz: Tizim haqida ma’lumot yuklandi

source: Your system information was uploaded to %s. This link was placed in your clipboard so you can paste it on IRC.
uz: Tizim haqida ma'lumot %s ga yuklandi. Ushbu havola almashish buferiga qo‘yildi va IRCga joylashtirilishi mumkin.

source: An error occurred while uploading the system information
uz: Tizim haqida ma'lumot yuklanganda xato yuz berdi

source: Copy and paste the system information manually into a pastebin site like https://pastebin.com and share the link on IRC.
uz: Tizim haqida ma’lumotni qo‘lda nusxalang https://pastebin.com kabi saytga joylashtiring va IRCda havola bilan ulushing.

source: Ignore this report
uz: Ushbu hisobotga e’tibor bermaslik

source: Are you sure you want to ignore this report?
uz: Ushbu xabarni e’tiborsiz qoldirishga ishonchingiz komilmi?

source: The report will be permanently ignored and will no longer be visible.
uz: Hisobot butunlay e’tiborga olinmaydi va endi ko‘rinmaydi.

source: The debug symbols are missing for %(program)s. Please install %(package)s.
uz: %(program)s uchun tuzatish belgilari mavjud emas. Iltimos %(package)s o‘rnating.

source: The package providing %s could not be found. If you want to generate a stack trace for this crash report, please reinstall it.
uz: %s ta'minlovchi paket topilmadi. Agar Siz ushbu buzilish haqida hisoboti uchun stek izini yaratmoqchi bo‘lsangiz, iltimos uni qayta o‘rnating.

source: The headers or binaries installed on your system do not match the code which was executed during the crash. They probably got upgraded since. A stack trace is available in 'Local Files' but its content is probably inaccurate.
uz: Tizimingizda o‘rnatilgan sarlavhalar yoki ikkilik fayllar buzilish paytida bajarilgan kodga mos kelmaydi. Ular, ehtimol, o‘shandan beri yangilangan. Stek izi "Mahalliy fayllar" da mavjud, ammo uning mazmuni noto‘g‘ri bo‘lishi mumkin.

source: Show System Reports
uz: Tizim hisobotlarini ko‘rsatish

source: Some system reports require your attention
uz: Ba'zi tizim hisobotlari sizning e'tiboringizni talab qiladi

source: System Snapshots
uz: Tizim snapshotlari

source: A Timeshift system snapshot is being created.
uz: Timeshift tizim snapshoti yaratilmoqda.

source: Automatic Updates
uz: Avtomatik yangilanishlar

source: Automatic updates are being installed.
uz: Avtomatik yangilanishlar o‘rnatilmoqda.

source: Troubleshoot problems
uz: Muammolarni bartaraf qilish

source: Troubleshooting Tool
uz: Muaamoni bartaraf qilish vositasi

source: Running system checks...
uz: Tizim tekshirishni ishga tushirish...

source: No problems were detected
uz: Muammolar aniqlanmadi

source: System reports
uz: Tizim hisobotlari

source: Copy
uz: Nusxalash

source: Copy to clipboard (code tags are added to make it easy to paste the system information into the forums)
uz: Almashish buferiga nusxalash (tizim haqida ma'lumotni forumlarga oson joylashtirish uchun kod teglari qo‘shilgan)

source: Upload
uz: Yuklash

source: Upload to a pastebin service (no personal information included)
uz: Pastebin xizmatiga yuklash (shaxsiy ma'lumot qo‘shilmagan)

source: System information
uz: Tizim haqida ma'lumot

source: Crash reports are not available
uz: Buzilish hisobotlari mavjud emas

source: To enable crash reporting, install systemd-coredump and reboot your computer.
uz: Buzilish hisobotlarini yoqish uchun systemd-coredump o‘rnating va kompyuterni qayta yuklang.

source: Crash reports:
uz: Buzilish hisobotlari:

source: Stack trace:
uz: Stek izi:

source: When seeking help, check for existing bug reports, pastebin the trace, share crash.tar.gz (from Local Files) and explain how to reproduce the crash.
uz: Yordam izlaganda mavjud xato hisobotlarini tekshiring, izni joylashtiring, crash.tar.gz ulushing (mahalliy fayllardan) va buzilishni qanday takrorlash mumkinligini tushuntiring.

source: Local Files
uz: Mahalliy fayllar

source: Open the directory containing crash.tar.gz and its content.
uz: Crash.tar.gz va uning mazmunini o‘z ichiga olgan katalogni oching.

source: Bug Tracker
uz: Xatolarni kuzatuvchi

source: Find the most appropriate bug tracker.
uz: Eng mos xato kuzatuvchisini toping.

source: Upload the trace to the Internet.
uz: Izni Internetga yuklash.

source: Developers need to know where the code fails or how to reproduce the issue. Always provide a trace and reliable instructions to trigger/observe the problem.
uz: Ishlab chiquvchilar kod qayerda ishlamay qolganligini yoki muammoni qanday qayta ishlab chiqarishni bilishlari kerak. Muammoni qo‘zg‘atish/kuzatish uchun har doim iz va ishonchli ko‘rsatmalarni taqdim eting.

source: Crash reports
uz: Buzilish hisobotlari

source: Add the XApp Status applet
uz: XApp Status appletini qo‘shish

source: The XApp Status applet allows applications to provide a tray icon without rendering glitches and with support for HiDPI and symbolic icons.
uz: XApp Status ilovasi ilovalarga nosozliklarsiz va HiDPI va ramziy piktogrammalarni qo‘llab-quvvatlagan holda laganda belgisini taqdim etish imkonini beradi.

source: Right-click the panel and choose 'Add to Panel'.
uz: Panelni o‘ng tugmasini bosing va "Panelga qo‘shish"ni tanlang.

source: Add the XApp Status applet to the panel
uz: XApp Status appletini panelga qo‘shish

source: Install multimedia codecs
uz: Multimedia kodeklarini o‘rnatish

source: Multimedia codecs are required to play some video formats and to properly render some websites.
uz: Multimedia kodeklari ba'zi video formatlarini ijro etish va ba'zi veb-saytlarni to‘g‘ri ko‘rsatish uchun talab qilinadi.

source: Install the Multimedia Codecs
uz: Multimedia kodeklarini o‘rnatish

source: Set up the system restore utility
uz: Tizimni tiklash vositasini sozlash

source: Linux Mint provides a system restore utility called Timeshift.
uz: Linux Mint Timeshift deb nomlangan tizimni tiklash dasturini taqdim etadi.

source: Thanks to Timeshift you can take snapshots of the system, either manually or automatically.
uz: Timeshift tufayli siz tizimning tasvirlarini qo‘lda yoki avtomatik ravishda olishingiz mumkin.

source: If something goes wrong you can then restore your operating system from a previously saved snapshot.
uz: Agar biror narsa noto‘g‘ri bo‘lsa, operatsion tizimingizni avval saqlangan tasvirdan tiklashingiz mumkin.

source: Launch Timeshift
uz: Timeshift ishga tushirish

source: A new version of Linux Mint is available
uz: Linux Mint yangi versiyasi mavjud

source: Visit %s for the latest announcements.
uz: Eng soʻnggi eʼlonlar uchun %s saytiga tashrif buyuring.

source: Upgrade to %s
uz: %s ga yangilash

source: Your version of Linux Mint will soon reach End-Of-Life (EOL)
uz: Sizning Linux Mint versiyangiz tez orada qo‘llab-quvvatlash muddatining tugashi (EOL) ga yetadi

source: It will stop receiving support and updates in a day.
uz: U bir kun ichida qo‘llab-quvvatlash va yangilanishlarni olishni to‘xtatadi.

source: Your version of Linux Mint is no longer supported
uz: Sizdagi Linux Mint versiyasi boshqa qo‘llab-quvvatlanmaydi

source: It reached End-Of-Life (EOL) yesterday.
uz: U kecha qo‘llab-quvvatlash muddatining tugashiga (EOL) yetdi.

source: Visit %s to find information about newer releases.
uz: Yangi relizlar haqida ma'lumot topish uchun %s ga tashrif buyuring.

source: Perform usrmerge conversion
uz: Usrmerge aylantirishni bajaring

source: We recommend you convert your system with usrmerge.
uz: Tizimingizni usrmerge bilan aylantirishingizni tavsiya qilamiz.

source: This is done already for new installations of Linux Mint, starting with 20.1.
uz: Bu Linux Mintning 20.1 dan boshlab yangi o‘rnatishlari uchun qilingan.

source: To convert your system, open a terminal and type:
uz: Tizimingizni aylantirish uchun terminalni oching va quyidagilarni yozing:

source: You should reboot the computer once this completes.
uz: Buni tugatgandan so‘ng kompyuterni qayta ishga tushirishingiz kerak.

source: More information
uz: Qo‘shimcha ma'lumot

source: Remove conflicting indicators
uz: Qarama-qarshi ko‘rsatkichlarni olib tashlash

source: The following packages prevent tray icons from working properly:
uz: Quyidagi paketlar trey belgilarining to‘g‘ri ishlashiga xalaqit beradi:

source: Note: You will need to log out after removing them.
uz: Eslatma: Ularni olib tashlaganingizdan so‘ng tizimdan chiqishingiz kerak bo‘ladi.

source: Remove the conflicting packages.
uz: Qarama-qarshi paketlarni olib tashlash.

source: Install language packs
uz: Til paketlarini o‘rnatish

source: The following localization packages are missing to properly support your language:
uz: Tilingizni toʻgʻri qoʻllab-quvvatlash uchun quyidagi mahalliylashtirish paketlari yetishmayapti:

source: Install the Language Packs
uz: Til paketlarini o‘rnatish

source: Install hardware drivers
uz: Apparat ta'minoti drayverlarini o‘rnatish

source: Processor
uz: Protsessor

source: Unknown
uz: Noma'lum

source: %s (unknown)
uz: %s (noma‘lum)

source: Hardware drivers are available for the following devices:
uz: Quyidagi qurilmalar uchun apparat ta'minoti drayverlari mavjud:

source: Launch the Driver Manager
uz: Drayver menejerini ishga tushirish
